"""

Тестирование:
- Ручное
- Автоматизированное (с помощью специальных инструментов для автоматизации)

Что такое Selenium?
Selenium – это проект, в рамках которого разрабатывается серия программных продуктов
с открытым исходным кодом (open source):

- Selenium RC --> Remote Control, средство для «удалённого» управления браузером,
- Selenium Server --> это сервер, позволяет управлять браузером с удалённой машины по сети
- Selenium Grid --> кластер, состоящий из нескольких Selenium-серверов.
Он предназначен для организации распределённой сети, позволяющей параллельно запускать много браузеров
на большом количестве машин
- Selenium IDE --> плагин к браузеру Firefox, который может записывать действия пользователя,
воспроизводить их, а также генерировать код для WebDriver или Selenium RC
- Selenium WebDriver --> основной продукт, разрабатываемый в рамках проекта Selenium.
Это библиотека для управления браузерами

"""
