# посмотрим снова на нашу функцию example
# можно сделать вывод, что подобного рода функции бесполезны
# так как она просто ничего не делает,
# однако
def example():
    pass


"""
# К примеру мы решили написать калькулятор
# Прежде чем его создавать, мы изначально
# должны спроектировать его, т.е. прописать логику
# и те части программы, которые нам понадобятся
"""


# нам будет нужна функция сложения
def give_sum():
    pass


# функция для получения разницы чисел
def give_minus():
    pass


"""
остальные допишите сами.
Подобное использование функций по сути делает заметки
для последующего написания функционала к ним.
Видя такую функцию в коде, особенно понимая ее название
программист может оставить своего рода заметку (заметки), чтобы не забыть
что нам будет нужна такая функция, при этом создавая возможность
отложить реализацию данной функции до момента, когда она пригодится.
"""
