import random

"""
Следует запомнить, что объявление функций для Вашего кода
производится в самом начале программы, после import-а 
всех необходимых библиотек
"""


def give_sum():
    pass


def give_minus():
    pass


"""
реализуем сохранение случайных чисел от 1 до 100 в 
переменные num1 и num2. 
Как мы помним, калькулятор работает с двумя числами (как правило)
на данном этапе у нас уже есть скелет, для последующего построения
нашего калькулятора, однако наши функции пока еще не способны
возвращать нам значения, которые мы бы смогли использовать
"""
num1 = random.randint(1, 100)
num2 = random.randint(1, 100)

