# IT компания за год нанимает 50 сотрудников, которым на старте платит бонус в размере $700
# Найти общее количество трат на стартовые бонусы за 5 лет

people_count_per_year = 50
extra_money = 700
years = 5
result = (people_count_per_year * extra_money * years)
print(result)
print("слишком много, надо кого-то уволить")